# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# CLI Apps
# IMPORTANT: Do NOT add `node` here, instead install it using `nvm` (github.com/nvm-sh/nvm)
brew "bash"                          # Latest Bash version
brew "bat"                           # Clone of `cat` with syntax highlighting and Git integration
brew "chezmoi"                       # Manage your dotfiles across multiple diverse machines, securely
brew "eza"                           # Modern, maintained replacement for `ls`
brew "fd"                            # Simple, fast and user-friendly alternative to `find`
brew "fdupes"                        # Identify or delete duplicate files
brew "ffmpeg"                        # Play, record, convert, and stream audio and video
brew "fzf"                           # Command-line fuzzy finder
brew "gh"                            # GitHub command-line tool
brew "git"                           # Latest Git version
brew "grep"                          # Latest Grep version (GNU grep, egrep and fgrep)
brew "imagemagick"                   # Tools and libraries to manipulate images in many formats
brew "mackup"                        # Keep your Mac's application settings in sync
brew "macos-trash"                   # Move files and folders to the trash
brew "mas"                           # Mac App Store command-line interface
brew "tldr"                          # Simplified and community-driven `man` pages
brew "webp"                          # Image format providing lossless and lossy compression for web images
brew "xdg-ninja"                     # Check your $HOME for unwanted files and directories
brew "yarn"                          # JavaScript package manager

# GUI Apps (+ fonts)
cask "1password"                     # Password manager that keeps all passwords secure behind one password
cask "appcleaner"                    # Application uninstaller
cask "autofirma"                     # Digital signature editor and validator
cask "colour-contrast-analyser"      # Colour contrast checker
cask "deepl"                         # Trains AIs to understand and translate texts
cask "discord"                       # Voice and text chat software
cask "figma"                         # Collaborative team software
cask "firefox"                       # Web browser
cask "font-asap"
cask "font-asap-condensed"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-serif"
cask "font-inter"                    # Variable font designed for display
cask "font-jetbrains-mono"           # Typeface made for developers
cask "font-meslo-for-powerlevel10k"  # Monospace font customized for Powerlevel10k
cask "font-new-york"                 # Serif font "New York" by Apple
cask "font-sf-compact"               # Compact variant of "San Francisco" by Apple
cask "font-sf-mono"                  # Monospaced variant of "San Francisco" by Apple
cask "font-sf-pro"                   # Sans-serif variant of "San Francisco" by Apple
cask "font-source-sans-3"
cask "font-source-serif-4"
cask "gog-galaxy"                    # Game client
cask "google-chrome"                 # Web browser
cask "hp-easy-start"                 # Set up your HP printer
cask "iina"                          # Free and open-source media player
cask "imageoptim"                    # Tool to optimise images to a smaller size
cask "inkscape"                      # Vector graphics editor
cask "iterm2"                        # Terminal emulator as alternative to Apple's Terminal app
cask "keka"                          # File archiver
cask "kekaexternalhelper"            # Helper application for the Keka file archiver
cask "logi-options-plus"             # Software for Logitech devices
cask "maccy"                         # Clipboard manager
cask "mkvtoolnix"                    # Set of tools to create, alter and inspect Matroska files (MKV)
cask "nordvpn"                       # VPN client for secure internet access and private browsing
cask "notion"                        # App to write, plan, collaborate, and get organised
cask "openemu"                       # Retro video game emulation
cask "pika"                          # Colour picker for colours onscreen
cask "porting-kit"                   # Install games and apps compiled for Microsoft Windows
cask "qbittorrent"                   # Peer to peer Bitorrent client
# Rectangle: for when not using my personal iCloud account (I already purchased Magnet, an alternative app)
# cask "rectangle"                   # Move and resize windows using keyboard shortcuts or snap areas
cask "safari-technology-preview"     # Web browser
cask "spotify"                       # Music streaming service
cask "visual-studio-code"            # Open-source code editor

# Mac App Store Apps
mas "1Password for Safari", id: 1569813296
mas "Actions", id: 1586435171
mas "AdBlock", id: 1402042596
mas "AdGuard for Safari", id: 1440147259
mas "Color Picker", id: 1545870783
mas "Curve", id: 1219074514
mas "Fonts Ninja for Safari", id: 1480227114
mas "Grammarly for Safari", id: 1462114288
mas "Ice Cubes", id: 6444915884
mas "iMovie", id: 408981434
mas "Keepa - Price Tracker", id: 1533805339
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Notion Web Clipper", id: 1559269364
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pandan", id: 1569600264
mas "PocketTube", id: 1533703891
mas "Pure Paste", id: 1611378436
mas "Refined GitHub", id: 1519867270
mas "Shazam", id: 897118787
mas "Speediness", id: 1596706466
mas "Super Agent", id: 1568262835
mas "Todoist", id: 585829637
mas "VisBug", id: 1538509686
