# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager

# Development
brew 'imagemagick'
brew 'yarn'

# Apps
cask '1password'
cask 'discord'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'imageoptim'
cask 'visual-studio-code'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
